Extensions/нп_ДатыЗапретаИзменения/configurator/Documents/нп_ЗаявкаНаОткрытиеПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>нп_ЗаявкаНаОткрытиеПериода</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделДатыЗапрета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОткрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУказания</Name>
					<Comment>Как в типовой форме дат запрета</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.нп_СпособыУказанияОткрытияПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектДатыЗапрета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
								<v8:Type>cfg:CatalogRef.СценарииТоварногоПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделДатыЗапрета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/нп_ДатыЗапретаИзменения/configurator/Documents/нп_ЗаявкаНаОткрытиеПериода/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Немедленный возврат границы по заявке.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.нп_ЗаявкаНаОткрытиеПериода
//
Процедура ЗакрытьПериодДосрочно(ДокументСсылка) Экспорт
	
	нп_ДатыЗапретаИзменения.ЗакрытьПериодДосрочно(ДокументСсылка);
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Определяет настройки печати документа.
//
// Параметры:
//  Настройки - Структура
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.нп_ЗаявкаНаОткрытиеПериода";
	КомандаПечати.Идентификатор = "ЗаявкаНаОткрытиеПериода";
	КомандаПечати.Представление = НСтр("ru = 'Заявка на открытие периода'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - Массив из ДокументСсылка.нп_ЗаявкаНаОткрытиеПериода
//  ПараметрыПечати - Структура
//  КоллекцияПечатныхФорм - ТаблицаЗначений
//  ОбъектыПечати - СписокЗначений
//  ПараметрыВывода - Структура
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если Не УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявкаНаОткрытиеПериода") Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЗаявкаНаОткрытиеПериода",
		НСтр("ru = 'Заявка на открытие периода'"),
		СформироватьПечатнуюФормуЗаявки(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.нп_ЗаявкаНаОткрытиеПериода.ПФ_MXL_ЗаявкаНаОткрытиеПериода");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьПечатнуюФормуЗаявки(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_нп_ЗаявкаНаОткрытиеПериода";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы(
		"Документ.нп_ЗаявкаНаОткрытиеПериода.ПФ_MXL_ЗаявкаНаОткрытиеПериода");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрокаПустая = Макет.ПолучитьОбласть("СтрокаПустая");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заявка.Ссылка КАК Ссылка,
	|	Заявка.Номер КАК Номер,
	|	Заявка.Дата КАК Дата,
	|	Заявка.Пользователь КАК Пользователь,
	|	Заявка.ПериодС КАК ПериодС,
	|	Заявка.СрокДействия КАК СрокДействия,
	|	Заявка.СпособУказания КАК СпособУказания,
	|	Заявка.ПричинаОткрытия КАК ПричинаОткрытия,
	|	Заявка.Ответственный КАК Ответственный,
	|	Заявка.РазделДатыЗапрета КАК РазделШапки,
	|	Строки.НомерСтроки КАК НомерСтроки,
	|	Строки.РазделДатыЗапрета КАК РазделДатыЗапрета,
	|	Строки.ОбъектДатыЗапрета КАК ОбъектДатыЗапрета
	|ИЗ
	|	Документ.нп_ЗаявкаНаОткрытиеПериода КАК Заявка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.нп_ЗаявкаНаОткрытиеПериода.Объекты КАК Строки
	|		ПО Строки.Ссылка = Заявка.Ссылка
	|ГДЕ
	|	Заявка.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Заявка.Дата,
	|	Заявка.Номер,
	|	НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Пользователь),
	|	МАКСИМУМ(ПериодС),
	|	МАКСИМУМ(СрокДействия),
	|	МАКСИМУМ(СпособУказания),
	|	МАКСИМУМ(ПричинаОткрытия),
	|	МАКСИМУМ(Ответственный),
	|	МАКСИМУМ(РазделШапки)
	|ПО
	|	Ссылка";
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачала = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьЗаголовок.Параметры.Номер = ВыборкаДокументов.Номер;
		ОбластьЗаголовок.Параметры.Дата = Формат(ВыборкаДокументов.Дата, "ДЛФ=D");
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ОбластьШапка.Параметры.Пользователь = ВыборкаДокументов.Пользователь;
		ОбластьШапка.Параметры.ПериодС = Формат(ВыборкаДокументов.ПериодС, "ДЛФ=D");
		ОбластьШапка.Параметры.СрокДействия = ВыборкаДокументов.СрокДействия;
		ОбластьШапка.Параметры.СпособУказания = ВыборкаДокументов.СпособУказания;
		ОбластьШапка.Параметры.ПричинаОткрытия = ВыборкаДокументов.ПричинаОткрытия;
		ОбластьШапка.Параметры.Ответственный = ВыборкаДокументов.Ответственный;
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		ВыборкаСтрок = ВыборкаДокументов.Выбрать();
		НомерВыведенной = 0;
		Пока ВыборкаСтрок.Следующий() Цикл
			Если ВыборкаСтрок.НомерСтроки = Null Тогда
				Продолжить;
			КонецЕсли;
			НомерВыведенной = НомерВыведенной + 1;
			ЗаполнитьСтрокуПечати(
				ОбластьСтрока,
				НомерВыведенной,
				ВыборкаСтрок.РазделДатыЗапрета,
				ВыборкаСтрок.ОбъектДатыЗапрета,
				ВыборкаДокументов.РазделШапки);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		Если НомерВыведенной = 0 Тогда
			ЗаполнитьСтрокуПечати(
				ОбластьСтрока,
				1,
				ВыборкаДокументов.РазделШапки,
				Неопределено,
				ВыборкаДокументов.РазделШапки);
			Если ЗначениеЗаполнено(ВыборкаДокументов.РазделШапки) Тогда
				ТабличныйДокумент.Вывести(ОбластьСтрока);
			Иначе
				ТабличныйДокумент.Вывести(ОбластьСтрокаПустая);
			КонецЕсли;
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
			ТабличныйДокумент, НомерСтрокиНачала, ОбъектыПечати, ВыборкаДокументов.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ЗаполнитьСтрокуПечати(ОбластьСтрока, НомерСтроки, Раздел, ОбъектДатыЗапрета, РазделШапки)
	
	РазделПечати = Раздел;
	Если Не ЗначениеЗаполнено(РазделПечати) Тогда
		РазделПечати = РазделШапки;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РазделПечати) И Не ЗначениеЗаполнено(ОбъектДатыЗапрета) Тогда
		ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
		ОбластьСтрока.Параметры.Раздел = НСтр("ru = 'все разделы / общая дата адресата'");
		ОбластьСтрока.Параметры.Объект = "";
		Возврат;
	КонецЕсли;
	
	ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
	ОбластьСтрока.Параметры.Раздел = РазделПечати;
	Если ЗначениеЗаполнено(ОбъектДатыЗапрета) Тогда
		ОбластьСтрока.Параметры.Объект = ОбъектДатыЗапрета;
	Иначе
		ОбластьСтрока.Параметры.Объект = НСтр("ru = 'общая дата раздела'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
